# Titanic Survival Prediction

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('titanic.xls')
df.shape

(1309, 14)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [4]:
df.describe(include='all')

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
count,1309.000000,1309.000000,1309,1309,1046.000000,1309.000000,1309.000000,1309,1308.000000,295,1307,486,121.000000,745
unique,NaN,NaN,1307,2,NaN,NaN,NaN,939,NaN,186,3,28,NaN,369
top,NaN,NaN,"Connolly, Miss. Kate",male,NaN,NaN,NaN,CA. 2343,NaN,C23 C25 C27,S,13,NaN,"New York, NY"
freq,NaN,NaN,2,843,NaN,NaN,NaN,11,NaN,6,914,39,NaN,64
mean,2.294882,0.381971,NaN,NaN,29.881135,0.498854,0.385027,NaN,33.295479,NaN,NaN,NaN,160.809917,NaN
std,0.837836,0.486055,NaN,NaN,14.413500,1.041658,0.865560,NaN,51.758668,NaN,NaN,NaN,97.696922,NaN
min,1.000000,0.000000,NaN,NaN,0.166700,0.000000,0.000000,NaN,0.000000,NaN,NaN,NaN,1.000000,NaN
25%,2.000000,0.000000,NaN,NaN,21.000000,0.000000,0.000000,NaN,7.895800,NaN,NaN,NaN,72.000000,NaN
50%,3.000000,0.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN,NaN,155.000000,NaN
75%,3.000000,1.000000,NaN,NaN,39.000000,1.000000,0.000000,NaN,31.275000,NaN,NaN,NaN,256.000000,NaN
max,3.000000,1.000000,NaN,NaN,80.000000,8.000000,9.000000,NaN,512.329200,NaN,NaN,NaN,328.000000,NaN

In [5]:
print(list(df.columns))

['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [6]:
for col in list(df.columns):
    print('-'*50, '\n')
    print(col)
    print(df[col].value_counts())

--------------------------------------------------

pclass
3    709
1    323
2    277
Name: pclass, dtype: int64
--------------------------------------------------

survived
0    809
1    500
Name: survived, dtype: int64
--------------------------------------------------

name
Connolly, Miss. Kate             2
Kelly, Mr. James                 2
Allen, Miss. Elisabeth Walton    1
Ilmakangas, Miss. Ida Livija     1
Ilieff, Mr. Ylio                 1
                                ..
Hart, Miss. Eva Miriam           1
Harris, Mr. Walter               1
Harris, Mr. George               1
Harper, Rev. John                1
Zimmerman, Mr. Leo               1
Name: name, Length: 1307, dtype: int64
--------------------------------------------------

sex
male      843
female    466
Name: sex, dtype: int64
--------------------------------------------------

age
24.0000    47
22.0000    43
21.0000    41
30.0000    40
18.0000    39
           ..
0.3333      1
22.5000     1
70.5000     1
0.6667      1
26.5000     1
Name: age, Length: 98, dtype: int64
--------------------------------------------------

sibsp
0    891
1    319
2     42
4     22
3     20
8      9
5      6
Name: sibsp, dtype: int64
--------------------------------------------------

parch
0    1002
1     170
2     113
3       8
4       6
5       6
6       2
9       2
Name: parch, dtype: int64
--------------------------------------------------

ticket
CA. 2343        11
CA 2144          8
1601             8
S.O.C. 14879     7
3101295          7
                ..
C 7076           1
341826           1
7546             1
3474             1
315082           1
Name: ticket, Length: 939, dtype: int64
--------------------------------------------------

fare
8.0500     60
13.0000    59
7.7500     55
26.0000    50
7.8958     49
           ..
15.0500     1
9.6875      1
15.5792     1
12.0000     1
7.8750      1
Name: fare, Length: 281, dtype: int64
--------------------------------------------------

cabin
C23 C25 C27        6
G6                 5
B57 B59 B63 B66    5
F4                 4
F33                4
                  ..
C132               1
E60                1
B52 B54 B56        1
C49                1
F38                1
Name: cabin, Length: 186, dtype: int64
--------------------------------------------------

embarked
S    914
C    270
Q    123
Name: embarked, dtype: int64
--------------------------------------------------

boat
13         39
C          38
15         37
14         33
4          31
10         29
5          27
3          26
9          25
11         25
7          23
16         23
8          23
6          20
D          20
12         19
2          12
A          11
B           9
1           5
C D         2
13 15       2
5 7         2
8 10        1
13 15 B     1
5 9         1
15 16       1
2           1
Name: boat, dtype: int64
--------------------------------------------------

body
135.0    1
101.0    1
37.0     1
285.0    1
156.0    1
        ..
97.0     1
174.0    1
169.0    1
245.0    1
304.0    1
Name: body, Length: 121, dtype: int64
--------------------------------------------------

home.dest
New York, NY                                    64
London                                          14
Montreal, PQ                                    10
Paris, France                                    9
Cornwall / Akron, OH                             9
                                                ..
Chelsea, London                                  1
Harrow-on-the-Hill, Middlesex                    1
Copenhagen, Denmark                              1
Guernsey / Montclair, NJ and/or Toledo, Ohio     1
Antwerp, Belgium / Stanton, OH                   1
Name: home.dest, Length: 369, dtype: int64

In [7]:
df.drop(columns=['name', 'ticket', 'cabin', 'boat', 'home.dest'], inplace=True)

In [8]:
df.isna().sum().sort_values()/df.shape[0]

pclass      0.000000
survived    0.000000
sex         0.000000
sibsp       0.000000
parch       0.000000
fare        0.000764
embarked    0.001528
age         0.200917
body        0.907563
dtype: float64

In [10]:
df.drop(columns='body', inplace=True)

## Preprocessing

In [13]:
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OrdinalEncoder, KBinsDiscretizer, Binarizer
from sklearn.pipeline import Pipeline, make_pipeline
from sklearn.compose import make_column_transformer

In [14]:
encode_sex = OrdinalEncoder()
encode_sibsp = Binarizer(threshold=1)
encode_parch = Binarizer()
process_fare = make_pipeline(
    SimpleImputer(strategy='mean'),
    KBinsDiscretizer(n_bins=3, encode='ordinal')
)
process_embarked = make_pipeline(
    SimpleImputer(strategy='most_frequent'),
    OrdinalEncoder()
)
process_age = make_pipeline(
    SimpleImputer(strategy='mean'),
    KBinsDiscretizer(n_bins=3)
)


transformer = make_column_transformer(
    (encode_sex, ['sex']),
    (encode_sibsp, ['sibsp']),
    (encode_parch, ['parch']),
    (process_fare, ['fare']),
    (process_embarked, ['embarked']),
    (process_age, ['age'])
)

In [15]:
from sklearn.model_selection import train_test_split

In [16]:
df.columns.to_list()

['pclass', 'survived', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked']

In [17]:
y = df['survived']
X = df.drop(columns='survived')

X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2)

In [18]:
X_train = transformer.fit_transform(X_train)

## Model